# Pandas Exercises

## Setup and Importing

### 1. Import Libraries

Before you begin you should import the two main data manipulation libraries for Python.

Note: Be sure to use their common aliases

In [1]:
import numpy as np
import pandas as pd

### 2. Importing from different sources

In the following blocks you will create a pandas dataframe and you will save that dataframe to a variable named ```df```. After each import, you should use another Pandas function to view your dataframe to ensure that it was imported correctly.

#### Import and view from CSV

In [2]:
df = pd.read_csv("C:/ddimil/lessons/Pandas/data/payers.csv")
df.head()

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
0,1038,constantin@example.net,Weissnat Group,Parisian,NaN,2015-12-21 17:00:25.839697,2015-12-22 21:19:23.416702,NaN,NaN,0,Card,NaN,40185.76
1,1178,susana@example.org,Bogisich and Bogisich Group,Cormier,NaN,2016-02-12 00:52:30.205216,NaN,NaN,NaN,0,Card,NaN,24870.32
2,45,bailey@example.org,Schultz and Hane and Sons,Hilpert,NaN,2015-07-01 22:19:34.948958,2016-01-05 22:54:01.211366,NaN,NaN,0,Card,NaN,11669.36
3,1084,torey@example.com,Lowe and Raynor Group,Olson,NaN,2016-01-13 20:00:45.953792,2016-01-14 19:05:16.638872,NaN,NaN,0,Card,NaN,35833.24
4,1077,felicia@example.org,Dooley and Schumm Group,Pfannerstill,NaN,2016-01-12 20:22:40.84605,2016-01-26 23:25:43.26928,NaN,NaN,0,Card,NaN,46005.43

#### Import and view from Excel

In [3]:
df = pd.read_excel("C:/ddimil/lessons/Pandas/data/payers.xlsx")
df.head()

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address
0,1038,constantin@example.net,Weissnat Group,Parisian,NaN,2015-12-21 17:00:25.840,2015-12-22 21:19:23.417,NaT,NaN,0,Card,NaN
1,1178,susana@example.org,Bogisich and Bogisich Group,Cormier,NaN,2016-02-12 00:52:30.205,NaT,NaT,NaN,0,Card,NaN
2,45,bailey@example.org,Schultz and Hane and Sons,Hilpert,NaN,2015-07-01 22:19:34.949,2016-01-05 22:54:01.211,NaT,NaN,0,Card,NaN
3,1084,torey@example.com,Lowe and Raynor Group,Olson,NaN,2016-01-13 20:00:45.954,2016-01-14 19:05:16.639,NaT,NaN,0,Card,NaN
4,1077,felicia@example.org,Dooley and Schumm Group,Pfannerstill,NaN,2016-01-12 20:22:40.846,2016-01-26 23:25:43.269,NaT,NaN,0,Card,NaN

#### Import and view from JSON

In [4]:
df = pd.read_json("C:/ddimil/lessons/Pandas/data/payers.json")
df.head()

,address,bill_day,company_name,created_at,deleted_at,email,id,intacct_id,name,notes,source,updated_at
0,None,0,Weissnat Group,2015-12-21 17:00:25.839697,NaT,constantin@example.net,1038,None,Parisian,NaN,Card,2015-12-22 21:19:23.416702
1,None,0,Bogisich and Bogisich Group,2016-02-12 00:52:30.205216,NaT,susana@example.org,1178,None,Cormier,NaN,Card,NaT
2,None,0,Schultz and Hane and Sons,2015-07-01 22:19:34.948958,NaT,bailey@example.org,45,None,Hilpert,NaN,Card,2016-01-05 22:54:01.211366
3,None,0,Lowe and Raynor Group,2016-01-13 20:00:45.953792,NaT,torey@example.com,1084,None,Olson,NaN,Card,2016-01-14 19:05:16.638872
4,None,0,Dooley and Schumm Group,2016-01-12 20:22:40.846050,NaT,felicia@example.org,1077,None,Pfannerstill,NaN,Card,2016-01-26 23:25:43.269280

### 3. Different ways to preview dataset

There are three main methods in python to get a quick preview of your dataset. One method views the top rows, another method views the bottom rows, and the final method views a random sample of rows. Please re-import the CSV file as ```df``` and demonstrate all three methods.

In [6]:
import numpy as np
import pandas as pd

df = pd.read_csv("C:/ddimil/DDI Lessons/data/payers.csv")
df.head()

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
0,1038,constantin@example.net,Weissnat Group,Parisian,NaN,2015-12-21 17:00:25.839697,2015-12-22 21:19:23.416702,NaN,NaN,0,Card,NaN,40185.76
1,1178,susana@example.org,Bogisich and Bogisich Group,Cormier,NaN,2016-02-12 00:52:30.205216,NaN,NaN,NaN,0,Card,NaN,24870.32
2,45,bailey@example.org,Schultz and Hane and Sons,Hilpert,NaN,2015-07-01 22:19:34.948958,2016-01-05 22:54:01.211366,NaN,NaN,0,Card,NaN,11669.36
3,1084,torey@example.com,Lowe and Raynor Group,Olson,NaN,2016-01-13 20:00:45.953792,2016-01-14 19:05:16.638872,NaN,NaN,0,Card,NaN,35833.24
4,1077,felicia@example.org,Dooley and Schumm Group,Pfannerstill,NaN,2016-01-12 20:22:40.84605,2016-01-26 23:25:43.26928,NaN,NaN,0,Card,NaN,46005.43

#### View top rows

In [7]:
df.head()

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
0,1038,constantin@example.net,Weissnat Group,Parisian,NaN,2015-12-21 17:00:25.839697,2015-12-22 21:19:23.416702,NaN,NaN,0,Card,NaN,40185.76
1,1178,susana@example.org,Bogisich and Bogisich Group,Cormier,NaN,2016-02-12 00:52:30.205216,NaN,NaN,NaN,0,Card,NaN,24870.32
2,45,bailey@example.org,Schultz and Hane and Sons,Hilpert,NaN,2015-07-01 22:19:34.948958,2016-01-05 22:54:01.211366,NaN,NaN,0,Card,NaN,11669.36
3,1084,torey@example.com,Lowe and Raynor Group,Olson,NaN,2016-01-13 20:00:45.953792,2016-01-14 19:05:16.638872,NaN,NaN,0,Card,NaN,35833.24
4,1077,felicia@example.org,Dooley and Schumm Group,Pfannerstill,NaN,2016-01-12 20:22:40.84605,2016-01-26 23:25:43.26928,NaN,NaN,0,Card,NaN,46005.43

#### View bottom rows

In [8]:
df.tail()

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
4329,4396,mable@example.net,Macejkovic and Terry and Sons,Koepp,NaN,2019-11-11 17:24:02.740492,2019-11-11 18:14:07.35787,NaN,NaN,0,StripeACH,NaN,5163.52
4330,4338,amely@example.org,Bahringer and Willms and Sons,Windler,NaN,2019-09-23 20:43:18.840344,2019-11-11 18:19:56.855298,NaN,NaN,0,Card,NaN,43291.75
4331,4398,aron@example.org,Hettinger and Sons,Gulgowski,NaN,2019-11-13 17:57:42.630953,2019-11-20 14:07:00.968375,NaN,NaN,0,Card,NaN,38760.29
4332,4381,thurman@example.com,Bernhard Inc,Bailey,NaN,2019-10-24 22:23:44.647668,2019-12-09 20:01:10.594901,NaN,NaN,0,Card,NaN,45314.00
4333,4403,meda@example.net,Bauch and Schmidt and Sons,Bernhard,NaN,2019-12-27 22:52:03.629465,2020-01-07 19:30:57.121667,NaN,NaN,0,Card,NaN,28621.20

#### View random rows

In [10]:
df.sample()

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
2170,2252,dallas@example.net,Altenwerth and Batz and Sons,Kessler,NaN,2017-02-13 16:59:12.753008,2017-02-14 16:00:26.001358,NaN,NaN,0,Card,NaN,3286.46

How would you change the number or rows that are being viewed in each of these methods? Below, view a random sample of 20 rows.

#### View 10 random rows

In [11]:
df.sample(10)

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
4328,4372,letitia@example.org,Rowe and Sons,Wolff,NaN,2019-10-22 17:18:32.032963,2020-04-02 23:17:55.273883,NaN,NaN,0,Card,NaN,3925.64
1547,1620,clint@example.org,Terry and Kuphal and Sons,Wolff,NaN,2016-08-09 19:43:23.953558,2017-08-04 02:26:04.890473,NaN,NaN,0,Card,NaN,9479.79
908,34,jayde@example.org,Gislason Group,Pfannerstill,NaN,2015-07-01 22:19:34.948958,NaN,NaN,NaN,0,Card,NaN,41959.16
2219,2286,kenya@example.com,Tromp Group,Kuhlman,NaN,2017-02-24 19:00:01.720696,2017-03-01 18:34:29.890822,NaN,NaN,0,Card,NaN,23088.16
3596,3678,pamela@example.org,Mante and Hermiston LLC,Dare,NaN,2018-07-17 20:15:03.251689,2019-04-11 23:22:37.486535,NaN,NaN,0,Card,NaN,43747.28
647,785,fletcher@example.org,Champlin and Johnston Group,Collier,NaN,2015-09-14 18:32:22.682081,2015-11-23 22:40:16.708589,NaN,NaN,0,Card,NaN,2782.18
936,90,helen@example.net,Stark and Gibson and Sons,Collins,NaN,2015-07-01 22:19:34.948958,NaN,NaN,NaN,0,Card,NaN,24448.39
279,1236,raphaelle@example.net,Abbott and Sons,Moore,NaN,2016-03-07 16:44:47.680987,NaN,NaN,NaN,0,Card,NaN,14005.29
1102,640,adelbert@example.com,Kutch and Boyer LLC,Howe,NaN,2015-09-14 18:32:22.682081,NaN,NaN,NaN,0,Card,NaN,15440.53
1570,1649,tierra@example.org,Abernathy and Sons,Oberbrunner,NaN,2016-08-18 19:26:25.895615,2016-08-30 17:44:22.906846,NaN,NaN,0,Card,NaN,25016.71

#### View 20 random rows

In [12]:
df.sample(20)

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
839,608,alaina@example.org,McCullough LLC,Thompson,NaN,2015-09-14 18:32:22.682081,NaN,NaN,NaN,0,Card,NaN,27985.44
3178,3255,breana@example.org,Kshlerin Group,Schmitt,NaN,2018-01-22 20:58:08.93821,2018-01-22 21:38:54.768535,NaN,NaN,0,Card,NaN,49665.71
1505,1583,maurice@example.net,Bruen and Hand Group,Boyle,NaN,2016-07-22 17:42:00.820544,NaN,NaN,NaN,0,Card,NaN,22148.68
1304,1399,kaycee@example.com,Hayes and Daugherty Inc,Nitzsche,NaN,2016-05-13 21:07:47.179677,2020-07-20 16:34:31.303071,NaN,NaN,0,StripeACH,NaN,39356.30
3429,3491,elinore@example.com,Tremblay and Weber Group,Purdy,NaN,2018-04-13 17:10:17.813621,2019-08-16 01:13:13.483088,NaN,NaN,0,Card,NaN,35648.53
3013,3101,anissa@example.org,Ruecker and Gislason LLC,Medhurst,NaN,2017-11-06 19:53:02.970925,2017-11-08 18:55:56.617731,NaN,NaN,0,Card,NaN,25200.94
1479,1541,daren@example.net,Anderson and Sons,Spinka,NaN,2016-07-12 13:52:54.212396,2016-07-13 21:27:03.980425,NaN,NaN,0,Card,NaN,32330.00
2374,2463,carmen@example.net,Moen and Daugherty Inc,Sanford,NaN,2017-04-10 15:11:11.136197,2017-04-10 17:38:45.880544,NaN,NaN,0,Card,NaN,10229.50
1625,1708,daija@example.org,Quigley Inc,Von,NaN,2016-09-02 20:01:11.886754,2016-09-19 15:46:33.502279,NaN,NaN,0,Card,NaN,18728.18
433,1115,pansy@example.com,Dicki Group,Murazik,NaN,2016-01-22 23:18:59.017389,2016-10-11 19:54:00.626832,NaN,C-01533,0,Check,NaN,11547.88
723,588,vesta@example.com,Roberts LLC,Jast,NaN,2015-09-14 18:32:22.682081,NaN,NaN,NaN,0,Card,NaN,30066.67
2527,2616,theo@example.org,Ziemann and McClure Group,Yost,NaN,2017-05-25 21:19:28.959825,2017-08-02 19:42:02.550545,NaN,NaN,0,Card,NaN,26852.40
879,19,grayson@example.net,Kihn and Batz Inc,Abshire,NaN,2015-07-01 22:19:34.948958,2018-04-03 18:49:50.732326,NaN,C-00940,0,StripeACH,NaN,30271.46
4104,4180,lydia@example.net,Rolfson and Kunde Inc,Predovic,NaN,2019-05-15 17:26:06.991214,2019-06-05 16:24:34.927173,NaN,NaN,0,Card,NaN,13028.89
2188,1958,annamarie@example.net,Turcotte Inc,Marvin,NaN,2016-11-29 17:37:41.12468,2017-02-21 22:48:02.886275,NaN,NaN,0,Card,NaN,2393.11
2959,3040,gregoria@example.org,Schinner and Sons,Hickle,NaN,2017-10-10 14:31:17.238503,NaN,NaN,NaN,0,Card,NaN,6775.68
1197,1036,filomena@example.com,Hackett LLC,Hackett,NaN,2015-12-17 19:27:49.687774,2016-01-26 23:09:49.544815,NaN,NaN,0,Card,NaN,49101.48
1814,1875,yadira@example.org,Grimes LLC,Bernier,NaN,2016-10-24 22:07:06.321069,2016-10-28 21:19:56.877558,NaN,NaN,0,Card,NaN,22961.36
4268,4321,justus@example.org,Jerde Inc,Crooks,NaN,2019-09-09 18:47:49.826511,2019-10-01 16:54:18.877242,NaN,NaN,0,Card,NaN,35906.30
4042,4123,lucas@example.org,Terry Group,Renner,NaN,2019-04-11 02:33:54.070829,2019-04-11 17:52:58.66098,NaN,NaN,0,Card,NaN,30146.09

#### View the number or rows and columns in your dataset

In [15]:
df.shape

(4334, 13)

#### Get basic info about your dataset

In [18]:
print(df.describe())

print("----------------------------------------------------------")

print(df.info())

                id  notes     bill_day      bill_amt
count  4334.000000    0.0  4334.000000   4334.000000
mean   2223.665436    NaN     0.035072  25557.751387
std    1267.603220    NaN     0.724225  14167.505568
min       1.000000    NaN    -1.000000   1004.320000
25%    1138.250000    NaN     0.000000  13217.625000
50%    2227.500000    NaN     0.000000  25226.240000
75%    3319.750000    NaN     0.000000  38148.070000
max    4404.000000    NaN    15.000000  49999.940000
----------------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4334 entries, 0 to 4333
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            4334 non-null   int64
 1   email         4334 non-null   object
 2   company_name  4334 non-null   object
 3   name          4334 non-null   object
 4   notes         0 non-null      float64
 5   created_at    4334 non-null   object
 6   updated_at    3459 non-null   object
 7   deleted_at    12 non-null     object
 8   intacct_id    163 non-null    object
 9   bill_day      4334 non-null   int64
 10  source        4334 non-null   object
 11  address       26 non-null     object
 12  bill_amt      4334 non-null   float64
dtypes: float64(2), int64(2), object(9)
memory usage: 440.3+ KB
None

### 3. Simple selecting from a DataFrame

Once you have properly imported your data and you are going to start selecting and transforming it, you should create a copy so you can refer to your untransformed data later.

Note: It can sometimes

#### Create a copy of your original dataframe called df_copy

Remember that you can use both **.loc** and **.iloc** to access either rows or columns in a dataframe.

#### Select the 50th row in df_copy

Remember: Python and Pandas both start counting at 0, so the very first row is row index 0. The tenth row is at row index 9. For example ```df_copy.loc[0:9]``` will return 10 rows and ```df_copy.loc[0:10]``` will return 11 rows.

#### Select the 50th row index in df_copy

#### Select the row index 100 - 110

#### Select the row index for rows 35, 55, 75, and 95

#### Select only the "email" column from the dataframe

#### Select column "id" through column "name"

#### Select all rows from the columns "email", "name", and "bill_amt"

#### Select row indexes 10, 15, 21, and 71 with only the columns "id", "name",  and "source"

### 4. Conditional selection

#### Create a boolean mask for "bill_amt" less than 35000

#### Use boolean mask to get those rows which have "bill_amt" less than 3500

#### Find rows with the column "name" equal to "Price"

#### Find rows where the "update_at" column is before 2018

#### Select the rows where the "name" column is "Hackett" and the "bill_amt" is greater than 25000

### 5. Transforming a DataFrame

Note: After transforming a DataFrame it is good practice to display the transformed DataFrame to ensure that the expected changes were made. This can be done by viewing the top rows of the DataFrame or by checking specific rows that you are concerned with.

#### View the top rows before making any changes

#### Drop the "address" column from your DataFrame and check your results

#### Drop all columns with Nan values

#### Create a new column named "original_account" filled with the value "yes"

#### Add 10000 to the "bill_amt" for all rows

### 6. Save you DataFrame to a new CSV file in your data folder called "clean_payers.csv"

#### Check that "clean_payers.csv" was properly saved to your computer